snappy90_sediment/00_simpleFoam/constant/sedimentProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sedimentProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

particleSize  0.00010; // meters 

roughness 0.00001;   // meters 

shields 0.047; 

schmidt 0.5; // m/s

particleDensity 2650.0;

waterDensity 1000.0;

implicitOn true;

explicitOn true;

concentrationRelativeTolerance 1e-5;

// ************************************************************************* //
