snappy90_sediment/00_simpleFoam/0_orig/p
/* OpenFOAM p file from SSIIM 2  plastic test                                    test  */

FoamFile 
{
    version      2.0;
    format       ascii;
    class        volScalarField;
    location     "0";
    object       p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bedWall
    {
        type            zeroGradient;
    }
    leftSide
    {
        type            zeroGradient;
    }
    rightSide
    {
        type            zeroGradient;
    }
    freeSurface
    {
        type            zeroGradient;
    }
    inletWater
    {
        type            zeroGradient;
    }
    outletWater
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

